---
kind: method
id: M:Autodesk.Revit.DB.Structure.BoundaryConditions.GetBoundaryConditionsType
source: html/28e256af-2b2c-15a7-2d67-840189fdbef1.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditions.GetBoundaryConditionsType Method

Returns the boundary conditions type.

## Syntax (C#)
```csharp
public BoundaryConditionsType GetBoundaryConditionsType()
```

## Returns
The boundary conditions type.